# Remove or Fill Missing Data

### Load the data

In [1]:
import pandas as pd

# Create a data frame (load the data from an excel file)
filename = 'Ex_Files_Python_for_Data_Vis/Exercise Files/Pandas/data/car_financing.xlsx'
df = pd.read_excel(filename)

In [2]:
# Check the first few rows of data
df.head()

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
0,1,34689.96,687.23,202.93,484.30,34205.66,60,0.0702,Toyota Sienna
1,2,34205.66,687.23,200.10,487.13,33718.53,60,0.0702,Toyota Sienna
2,3,33718.53,687.23,197.25,489.98,33228.55,60,0.0702,Toyota Sienna
3,4,33228.55,687.23,194.38,492.85,32735.70,60,0.0702,Toyota Sienna
4,5,32735.70,687.23,191.50,495.73,32239.97,60,0.0702,Toyota Sienna

In [3]:
# Create and apply filters to the data frame
car_filter = df['car_type'] == 'Toyota Sienna'
interest_filter = df['interest_rate'] == 0.0702
df = df.loc[car_filter & interest_filter, :]

### Remove missing data

In [4]:
# Discover null values
#   - In this case, there is one null value in the "Interest Paid" column
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60 entries, 0 to 59
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             60 non-null     int64
 1   Starting Balance  60 non-null     float64
 2   Repayment         60 non-null     float64
 3   Interest Paid     59 non-null     float64
 4   Principal Paid    60 non-null     float64
 5   New Balance       60 non-null     float64
 6   term              60 non-null     int64
 7   interest_rate     60 non-null     float64
 8   car_type          60 non-null     object
dtypes: float64(6), int64(2), object(1)
memory usage: 4.7+ KB

In [5]:
# dropna method
#   - This gets the data frame from indexes 30-40, then drops any rows with NaN values
df[30:40].dropna(how = 'any')

,Month,Starting Balance,Repayment,Interest Paid,Principal Paid,New Balance,term,interest_rate,car_type
30,31,18858.57,687.23,110.32,576.91,18281.66,60,0.0702,Toyota Sienna
31,32,18281.66,687.23,106.94,580.29,17701.37,60,0.0702,Toyota Sienna
32,33,17701.37,687.23,103.55,583.68,17117.69,60,0.0702,Toyota Sienna
33,34,17117.69,687.23,100.13,587.10,16530.59,60,0.0702,Toyota Sienna
34,35,16530.59,687.23,96.70,590.53,15940.06,60,0.0702,Toyota Sienna
36,37,15346.07,687.23,89.77,597.46,14748.61,60,0.0702,Toyota Sienna
37,38,14748.61,687.23,86.27,600.96,14147.65,60,0.0702,Toyota Sienna
38,39,14147.65,687.23,82.76,604.47,13543.18,60,0.0702,Toyota Sienna
39,40,13543.18,687.23,79.22,608.01,12935.17,60,0.0702,Toyota Sienna

### Fill in missing data

In [7]:
# Check where the data is missing
df['Interest Paid'][30:40]

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35       NaN
36     89.77
37     86.27
38     82.76
39     79.22
Name: Interest Paid, dtype: float64

#### Approach 1: Fill the NaN with a zero
- NOT recommended as this is an arbitrary value that might skew the data

In [8]:
df['Interest Paid'][30:40].fillna(0)

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35      0.00
36     89.77
37     86.27
38     82.76
39     79.22
Name: Interest Paid, dtype: float64

#### Approach 2: Fill the NaN with a back fill
- Takes the value from the next index

In [10]:
df['Interest Paid'][30:40].bfill()

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35     89.77
36     89.77
37     86.27
38     82.76
39     79.22
Name: Interest Paid, dtype: float64

#### Approach 3: Fill the NaN with a forward fill
- Takes the value from the prior index

In [11]:
df['Interest Paid'][30:40].ffill()

30    110.32
31    106.94
32    103.55
33    100.13
34     96.70
35     96.70
36     89.77
37     86.27
38     82.76
39     79.22
Name: Interest Paid, dtype: float64

In [12]:
df['Interest Paid'][30:40].interpolate(method = 'linear')

30    110.320
31    106.940
32    103.550
33    100.130
34     96.700
35     93.235
36     89.770
37     86.270
38     82.760
39     79.220
Name: Interest Paid, dtype: float64

#### Approach 5: Fill the NaN with a hardcoded value
- Recommended if you know what the value should have been, as that will be the most accurate

In [13]:
# Create a filter for the missing values
interest_missing = df['Interest Paid'].isna()

# Fill any missing data with this value
df.loc[interest_missing, 'Interest Paid'] = 93.24

In [15]:
# Now there is no more missing data
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 60 entries, 0 to 59
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Month             60 non-null     int64
 1   Starting Balance  60 non-null     float64
 2   Repayment         60 non-null     float64
 3   Interest Paid     60 non-null     float64
 4   Principal Paid    60 non-null     float64
 5   New Balance       60 non-null     float64
 6   term              60 non-null     int64
 7   interest_rate     60 non-null     float64
 8   car_type          60 non-null     object
dtypes: float64(6), int64(2), object(1)
memory usage: 4.7+ KB